scripts/carga/yachay-carga.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Yachay Ayacucho - carga" enabled="true">
      <stringProp name="TestPlan.comments">Plan de carga de la seccion 7.7 del plan de desarrollo.

POLITICA (no negociable): este plan apunta SIEMPRE a un entorno local o a un
staging temporal, NUNCA a los servicios gratuitos de produccion. Agotar la
cuota de MapTiler, OpenWeather, Supabase o Upstash antes de la sustentacion
seria un dano irreversible por una prueba que se puede hacer en local.

Por eso el objetivo NO tiene valor por defecto remoto: `host` y `puerto`
apuntan a localhost y hay que sobrescribirlos a conciencia. Y por eso los
unicos endpoints que se golpean son los que sirve nuestro propio backend
contra PostgreSQL y Redis locales: no se toca ni un proveedor externo.

Dos escenarios:
  - base: 50 usuarios concurrentes, objetivo P95 &lt; 500 ms.
  - pico: rampa hasta 500 usuarios, el escenario de Semana Santa.

Se ejecuta cada uno DOS veces —con Redis frio y caliente— para documentar el
efecto de la cache.</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="host" elementType="Argument">
            <stringProp name="Argument.name">host</stringProp>
            <stringProp name="Argument.value">${__P(host,localhost)}</stringProp>
          </elementProp>
          <elementProp name="puerto" elementType="Argument">
            <stringProp name="Argument.name">puerto</stringProp>
            <stringProp name="Argument.value">${__P(puerto,8080)}</stringProp>
          </elementProp>
          <elementProp name="usuarios" elementType="Argument">
            <stringProp name="Argument.name">usuarios</stringProp>
            <stringProp name="Argument.value">${__P(usuarios,50)}</stringProp>
          </elementProp>
          <elementProp name="rampa" elementType="Argument">
            <stringProp name="Argument.name">rampa</stringProp>
            <stringProp name="Argument.value">${__P(rampa,10)}</stringProp>
          </elementProp>
          <elementProp name="duracion" elementType="Argument">
            <stringProp name="Argument.name">duracion</stringProp>
            <stringProp name="Argument.value">${__P(duracion,60)}</stringProp>
          </elementProp>
          <elementProp name="pausa" elementType="Argument">
            <stringProp name="Argument.name">pausa</stringProp>
            <stringProp name="Argument.value">${__P(pausa,1000)}</stringProp>
          </elementProp>
          <elementProp name="tokenInterno" elementType="Argument">
            <stringProp name="Argument.name">tokenInterno</stringProp>
            <stringProp name="Argument.value">${__P(tokenInterno,)}</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>

      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="Destino" enabled="true">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments"/>
        <stringProp name="HTTPSampler.domain">${host}</stringProp>
        <stringProp name="HTTPSampler.port">${puerto}</stringProp>
        <stringProp name="HTTPSampler.protocol">http</stringProp>
      </ConfigTestElement>
      <hashTree/>

      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Cabeceras" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Accept</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">X-Yachay-Interno</stringProp>
            <stringProp name="Header.value">${tokenInterno}</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>

      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Carga base o pico" enabled="true">
        <stringProp name="ThreadGroup.num_threads">${usuarios}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${rampa}</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${duracion}</stringProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController">
          <boolProp name="LoopController.continue_forever">true</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Listado de lugares" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.path">/api/v1/lugares?idioma=ES&amp;size=12</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Mapa GeoJSON" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.path">/api/v1/lugares/mapa?idioma=ES</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Agenda del mes" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.path">/api/v1/eventos/calendario?anio=2026&amp;mes=12&amp;idioma=ES</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Clima (mide la cache de Redis)" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.path">/api/v1/clima</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Directorio de negocios" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.path">/api/v1/negocios?idioma=ES&amp;size=12</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>

        <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Tiempo de reflexion" enabled="true">
          <stringProp name="ConstantTimer.delay">${pausa}</stringProp>
        </ConstantTimer>
        <hashTree/>

        <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Debe responder 200" enabled="true">
          <collectionProp name="Asserion.test_strings">
            <stringProp name="49586">200</stringProp>
          </collectionProp>
          <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
          <intProp name="Assertion.test_type">8</intProp>
        </ResponseAssertion>
        <hashTree/>

      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>